#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/BinaryStudio/test-workflow/runs/run-6H9zedPPRUmEhyFk

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.example_resource_group: Refreshing state... [id=/subscriptions/4e3a2c1b-54bb-4078-b8cb-09c0cfc936ab/resourceGroups/terraform-example-resources]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_group.example_container_group will be created
  + resource "azurerm_container_group" "example_container_group" {
      + dns_name_label      = "terraform-example"
      + exposed_port        = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + ip_address          = (known after apply)
      + ip_address_type     = "public"
      + location            = "westeurope"
      + name                = "terraform-example"
      + os_type             = "Linux"
      + resource_group_name = "terraform-example-resources"
      + restart_policy      = "Always"

      + container {
          + commands = (known after apply)
          + cpu      = 0.5
          + image    = "lecturedocker/frontend"
          + memory   = 0.5
          + name     = "my-app"

          + ports {
              + port     = 80
              + protocol = "TCP"
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + endpoint = (known after apply)

```            
</details>

*Pusher: @kopot-o-d, Action: `pull_request`*